// Запросити у користувача рік народження.

// Запитати в нього, в якому місті він живе.

// Запитати його улюблений вид спорту.

// При натисканні на ОК показуємо вікно, де має бути відображена наступна інформація:

// Його вік.
// Якщо користувач запровадить Київ, Вашингтон чи Лондон, то показати йому повідомлення - "Ти живеш у столиці..."
// і на місце точок підставляємо країну, столицю якої він запровадив. Інакше показуємо йому “ти живеш у місті…” і місце точок – введене місто.
// Вибираємо самі три види спорту та три чемпіони у цих видах. Відповідно, якщо користувач запровадить один із цих видів спорту,
// то показуємо йому повідомлення “Круто! Хочеш стати…” і підставляємо на місце точок ім'я та прізвище чемпіона.

// Все це має бути відображено в одному вікні (алерті).

// Якщо в якомусь випадку він не захоче вводити інформацію і натисне Скасувати, показати йому повідомлення - "Шкода, що Ви не захотіли ввести свій(ю) ..."
// і вказуємо, що він не захотів вводити - дату народження, місто або вид спорту.

let year = prompt("Введіть рік народження:");
let city = prompt("Введіть своє місто:");
let sport = prompt("Введіть вид спорту яким займаєтесь:");

// TODO: Перевірка ввів користувач рік народження
if (year === null || isNaN(year) || year === "") {
  // TODO: Користувач ввів або не вірні данні або не вводив рік
  var userAge = `Шкода, що Ви не захотіли ввести свій рік народження`;
} else {
  // TODO: Користувач ввів рік
  var userAge = `Ваш вік: ${2023 - parseInt(year)}`;
}

// TODO: Перевірка ввів користувач місто
if (city === null || city === "") {
  var userCity = `Шкода, що Ви не захотіли ввести своє місто`;
} else if (
  city.toLowerCase() === "київ" ||
  city.toLowerCase() === "вашингтон" ||
  city.toLowerCase() === "лондон"
) {
  // TODO: Якщо користувач ввів столицю
  var userCity = `Ти живеш у столиці ${city}`;
} else {
  // TODO: Якщо користувач ввів просто місто
  var userCity = `Ти живеш у місті ${city}`;
}

// TODO: Перевірка ввів користувач вид спорту
if (sport === null || sport === "") {
  var userSport = `Шкода, що Ви не захотіли ввести вид спорту`;
} else if (sport.toLowerCase() === "футбол") {
  // TODO: Якщо користувач ввів один з 3х видів спорту
  var userSport = `Круто! Хочеш стати Леонелем Мессі?`;
} else if (sport.toLowerCase() === "баскетбол") {
  var userSport = `Круто! Хочеш стати Майклом Джорданом?`;
} else if (sport.toLowerCase() === "бокс") {
  var userSport = `Круто! Хочеш стати Олександром Усиком?`;
} else {
  // TODO: Якщо користувач ввів любий інакший вид спорту
  var userSport = `На жаль я поки не знаю такого виду спорту`;
}

alert(`${userAge}\n${userCity}\n${userSport}`);
